In [13]:
import pandas as pd

df = pd.read_csv('./dataframe_treino_pandas.csv')
df

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São Paulo,3500.50,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de Janeiro,4000,10/03/2021,TI,170
2,3,Carlos,NaN,Belo Horizonte,NaN,2020/04/15,TI,quebradas
3,4,NaN,vinte,Salvador,5200.10,NaN,Marketing,180
4,5,Eva,27,NaN,"5000,00",2023-12-01,Financeiro,NaN
5,6,Felipe,40,RECIFE,NaN,15-08-2020,marketing,150

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 6 non-null      int64
 1   Nome               5 non-null      object
 2   Idade              5 non-null      object
 3   Cidade             5 non-null      object
 4   Salario            4 non-null      object
 5   Data_Admissao      5 non-null      object
 6   Departamento       6 non-null      object
 7   Horas_Trabalhadas  5 non-null      object
dtypes: int64(1), object(7)
memory usage: 516.0+ bytes

**Criando uma cópia do Dataframe**

In [15]:
# Criando uma copia do Dataframe
df_copia = df.copy()

### Trantando coluna nome

In [ ]:
# Removendo elementos nulos na coluna nome
name_none_removed = df_copia['Nome'].fillna('Não Informado', inplace=True)

# Removendo espaços extras de cada elemento da coluna nome
nomes_sem_espacos = list(map(lambda n:n.strip(), df_copia['Nome']))

# passando os nomes para a coluna nome
df_copia['Nome'] = nomes_sem_espacos

df_copia

C:\Users\davi.santos\AppData\Local\Temp\ipykernel_676\4139680794.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  name_none_removed = df_copia['Nome'].fillna('Não Informado', inplace=True)

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São Paulo,3500.50,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de Janeiro,4000,10/03/2021,TI,170
2,3,Carlos,NaN,Belo Horizonte,NaN,2020/04/15,TI,quebradas
3,4,Não Informado,vinte,Salvador,5200.10,NaN,Marketing,180
4,5,Eva,27,NaN,"5000,00",2023-12-01,Financeiro,NaN
5,6,Felipe,40,RECIFE,NaN,15-08-2020,marketing,150

### Tratando coluna idade

In [17]:
# Em caso de erro na conversão (p. ex., uma string que não representa um número), um valor vazio (null / nan) será
# atribuído no lugar
df_copia['Idade'] = pd.to_numeric(df_copia['Idade'], errors='coerce')
age_nan_removed = df_copia['Idade'].fillna(0, inplace=True)

# peguntar para a IA como deixar a idade no tipo inteiro e tirar do tipo float
df_copia

C:\Users\davi.santos\AppData\Local\Temp\ipykernel_676\1487248053.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  age_nan_removed = df_copia['Idade'].fillna(0, inplace=True)

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23.0,São Paulo,3500.50,2022-01-10,Financeiro,160
1,2,Bruno,30.0,Rio de Janeiro,4000,10/03/2021,TI,170
2,3,Carlos,0.0,Belo Horizonte,NaN,2020/04/15,TI,quebradas
3,4,Não Informado,0.0,Salvador,5200.10,NaN,Marketing,180
4,5,Eva,27.0,NaN,"5000,00",2023-12-01,Financeiro,NaN
5,6,Felipe,40.0,RECIFE,NaN,15-08-2020,marketing,150

In [18]:
# Convertendo a idade do tipo float para o tipo inteiro

df_copia['Idade'] = df_copia['Idade'].astype('Int64')

df_copia.loc[2,'Idade'] = 23
df_copia.loc[3,'Idade'] = 20

df_copia

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São Paulo,3500.50,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de Janeiro,4000,10/03/2021,TI,170
2,3,Carlos,23,Belo Horizonte,NaN,2020/04/15,TI,quebradas
3,4,Não Informado,20,Salvador,5200.10,NaN,Marketing,180
4,5,Eva,27,NaN,"5000,00",2023-12-01,Financeiro,NaN
5,6,Felipe,40,RECIFE,NaN,15-08-2020,marketing,150

### Tratando coluna cidade

In [19]:

# Removendo dados nulos, Lembrando que o inplace = True serve para inplantar as alterações em definitivo
df_copia['Cidade'].fillna('Não Informado', inplace=True)

# Removendo espaços em valores da tabela
city_sem_espaco = list(map(lambda x:x.strip(), df_copia['Cidade']))

# Formantado as cidades para que comece com a letra maiúscula
city_capitalize = list(map(lambda x:x.capitalize(), city_sem_espaco))


# Colocando os valores limpos na coluna Cidade
df_copia['Cidade'] = city_capitalize

df_copia

C:\Users\davi.santos\AppData\Local\Temp\ipykernel_676\3592856020.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_copia['Cidade'].fillna('Não Informado', inplace=True)

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.50,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de janeiro,4000,10/03/2021,TI,170
2,3,Carlos,23,Belo horizonte,NaN,2020/04/15,TI,quebradas
3,4,Não Informado,20,Salvador,5200.10,NaN,Marketing,180
4,5,Eva,27,Não informado,"5000,00",2023-12-01,Financeiro,NaN
5,6,Felipe,40,Recife,NaN,15-08-2020,marketing,150

### Tratando Coluna Salário

In [20]:
df_copia

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.50,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de janeiro,4000,10/03/2021,TI,170
2,3,Carlos,23,Belo horizonte,NaN,2020/04/15,TI,quebradas
3,4,Não Informado,20,Salvador,5200.10,NaN,Marketing,180
4,5,Eva,27,Não informado,"5000,00",2023-12-01,Financeiro,NaN
5,6,Felipe,40,Recife,NaN,15-08-2020,marketing,150

In [21]:
# Aqui eu estou convertendo o salário para um valor numerico em float
# O coerce serve para colocar valores nulos quando houver algum erro de tipo na coluna
df_copia['Salario'] = pd.to_numeric(df['Salario'], errors='coerce')

# aqui eu estou resolvendo um erro de um valor que estava errado antes pois estava com vírgula e quando eu
# converti ele passou a ser nulo depois eu só consertei com a forma correta.
df_copia.loc[2, 'Salario'] = 4000.0
df_copia.loc[4, 'Salario'] = 5000.0
df_copia.loc[5, 'Salario'] = 5200.1


# Agora vou passar os dados nulos para 0
df_copia['Salario'].fillna(0, inplace=True)

df_copia

C:\Users\davi.santos\AppData\Local\Temp\ipykernel_676\2995818428.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_copia['Salario'].fillna(0, inplace=True)

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.5,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de janeiro,4000.0,10/03/2021,TI,170
2,3,Carlos,23,Belo horizonte,4000.0,2020/04/15,TI,quebradas
3,4,Não Informado,20,Salvador,5200.1,NaN,Marketing,180
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,NaN
5,6,Felipe,40,Recife,5200.1,15-08-2020,marketing,150

### Tratando a coluna Data_Admissao

In [22]:
# Converte para datetime
df_copia['Data_Admissao'] = pd.to_datetime(df_copia['Data_Admissao'], errors='coerce')

# Atualiza valores específicos de forma segura
df_copia.loc[1, 'Data_Admissao'] = pd.Timestamp("2021-03-10")
df_copia.loc[2, 'Data_Admissao'] = pd.Timestamp("2020-04-15")
df_copia.loc[5, 'Data_Admissao'] = pd.Timestamp("2020-08-15")

# Preenche nulos com uma data padrão (datetime)
df_copia['Data_Admissao'].fillna(pd.Timestamp("1900-01-01"), inplace=True)

df_copia

C:\Users\davi.santos\AppData\Local\Temp\ipykernel_676\3261092608.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_copia['Data_Admissao'].fillna(pd.Timestamp("1900-01-01"), inplace=True)

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.5,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de janeiro,4000.0,2021-03-10,TI,170
2,3,Carlos,23,Belo horizonte,4000.0,2020-04-15,TI,quebradas
3,4,Não Informado,20,Salvador,5200.1,1900-01-01,Marketing,180
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,NaN
5,6,Felipe,40,Recife,5200.1,2020-08-15,marketing,150

### Tratando a coluna Departamento

In [23]:
df_copia.loc[5,'Departamento']= "Marketing"
df_copia

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.5,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de janeiro,4000.0,2021-03-10,TI,170
2,3,Carlos,23,Belo horizonte,4000.0,2020-04-15,TI,quebradas
3,4,Não Informado,20,Salvador,5200.1,1900-01-01,Marketing,180
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,NaN
5,6,Felipe,40,Recife,5200.1,2020-08-15,Marketing,150

### Tratando a coluna Horas_Trabalhadas

In [24]:
#Convertendo as horas trabalhadas para numerico e se houver erro de tipo o errors='coerce' permite 
# colocar um valor nulo ao invés de dar erro de tipo
df_copia['Horas_Trabalhadas'] = pd.to_numeric(df_copia['Horas_Trabalhadas'], errors='coerce')

# Preenchendo todos os valores que não são numeros para o padrão 0 e inplace true para salvar as alterações como definitivas no df
df_copia['Horas_Trabalhadas'].fillna(0, inplace=True)

# Convertendo as horas para tipo inteiro
df_copia['Horas_Trabalhadas'] = df_copia['Horas_Trabalhadas'].astype('Int64')

# Corrigindo as horas trabalhadas das linhas que estão sem horas
df_copia.loc[2,'Horas_Trabalhadas'] = 170
df_copia.loc[4,'Horas_Trabalhadas'] = 160

# Apresentado novo dataframe
df_copia

C:\Users\davi.santos\AppData\Local\Temp\ipykernel_676\2973488942.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_copia['Horas_Trabalhadas'].fillna(0, inplace=True)

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.5,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de janeiro,4000.0,2021-03-10,TI,170
2,3,Carlos,23,Belo horizonte,4000.0,2020-04-15,TI,170
3,4,Não Informado,20,Salvador,5200.1,1900-01-01,Marketing,180
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,160
5,6,Felipe,40,Recife,5200.1,2020-08-15,Marketing,150

# Salvando Dataframe e passando a cópia para o dataframe original

In [25]:
#Passando as alterações feitas na cópia para o dataframe original
df = df_copia
df

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.5,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de janeiro,4000.0,2021-03-10,TI,170
2,3,Carlos,23,Belo horizonte,4000.0,2020-04-15,TI,170
3,4,Não Informado,20,Salvador,5200.1,1900-01-01,Marketing,180
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,160
5,6,Felipe,40,Recife,5200.1,2020-08-15,Marketing,150

In [26]:
# Passando os dados tratados para um novo csv

df.to_csv("novo_Dataframe_treino_v2.csv")

# Manipulando dados da coluna

In [27]:
df

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.5,2022-01-10,Financeiro,160
1,2,Bruno,30,Rio de janeiro,4000.0,2021-03-10,TI,170
2,3,Carlos,23,Belo horizonte,4000.0,2020-04-15,TI,170
3,4,Não Informado,20,Salvador,5200.1,1900-01-01,Marketing,180
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,160
5,6,Felipe,40,Recife,5200.1,2020-08-15,Marketing,150

**Selecionando funcionarios do departamento de TI**

In [28]:
# selecionando apenas o departamento de TI
# OBS: Ao selecionar uma coluna string é necessário utilizar as aspas duplas ("") para definir
# qual departamento eu quero e a query precisa está entre aspas simples para funcionar
departamento_ti = df.query('Departamento == "TI"')
departamento_ti

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
1,2,Bruno,30,Rio de janeiro,4000.0,2021-03-10,TI,170
2,3,Carlos,23,Belo horizonte,4000.0,2020-04-15,TI,170

**Selecionando quem ganha mais que 4000**

In [29]:
# essa variavel armazena a selecao de pessoas de pessoas ganham mais que 4000
ganha_mais_4000 = df.query('Salario > 4000')
ganha_mais_4000

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
3,4,Não Informado,20,Salvador,5200.1,1900-01-01,Marketing,180
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,160
5,6,Felipe,40,Recife,5200.1,2020-08-15,Marketing,150

**Selecionando que tem menos de 30 anos**

In [30]:
idade_maior_30 = df.query('Idade < 30')
idade_maior_30

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas
0,1,Ana,23,São paulo,3500.5,2022-01-10,Financeiro,160
2,3,Carlos,23,Belo horizonte,4000.0,2020-04-15,TI,170
3,4,Não Informado,20,Salvador,5200.1,1900-01-01,Marketing,180
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,160

**Criando coluna de salario anual**

In [31]:
#Pegando cada item da coluna salario e multiplicando por 12 e ao mesmo tempo arredondando com a função round utilizando a função lambda
Salario_anual = list(map(lambda s:round(s*12, 2), df['Salario']))

df["Salario_Anual"] = Salario_anual
df

,ID,Nome,Idade,Cidade,Salario,Data_Admissao,Departamento,Horas_Trabalhadas,Salario_Anual
0,1,Ana,23,São paulo,3500.5,2022-01-10,Financeiro,160,42006.0
1,2,Bruno,30,Rio de janeiro,4000.0,2021-03-10,TI,170,48000.0
2,3,Carlos,23,Belo horizonte,4000.0,2020-04-15,TI,170,48000.0
3,4,Não Informado,20,Salvador,5200.1,1900-01-01,Marketing,180,62401.2
4,5,Eva,27,Não informado,5000.0,2023-12-01,Financeiro,160,60000.0
5,6,Felipe,40,Recife,5200.1,2020-08-15,Marketing,150,62401.2

**Média Salarial**

In [32]:
# Média Salarial

media_salarial = df['Salario'].mean()

print(media_salarial)

4483.45

**Funcionarios por Departamento**

In [33]:
# Agrupando com o groupby
# Depois contando com oa função  size() do pandas
# Depois resetando indice para ficar um dataframe organizado

grupo_departamento = df.groupby('Departamento').size().reset_index(name='Quantidade')
grupo_departamento

  Departamento  Quantidade
0   Financeiro           2
1    Marketing           2
2           TI           2

**Pagar o menor salário**

In [34]:
# Pegando o valor minimo de salario
menor_salario = df['Salario'].min()
print(menor_salario)

3500.5

**Horas Trabalhadas por cada departamento**

In [35]:
# Agrupando departamentos e somando em seguida
gp_dept = df.groupby('Departamento')
gp_dept['Horas_Trabalhadas'].sum().reset_index(name="Soma_Horas_Departamento")

  Departamento  Soma_Horas_Departamento
0   Financeiro                      320
1    Marketing                      330
2           TI                      340